run/porousPimpleFoam/cases/setups.orig/cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (1.000000e-01 0.000000e+00 0.000000e+00) // 0
    (6.123234e-18 1.000000e-01 0.000000e+00) // 1
    (-1.000000e-01 1.224647e-17 0.000000e+00) // 2
    (-1.836970e-17 -1.000000e-01 0.000000e+00) // 3
    (6.500000e-02 0.000000e+00 0.000000e+00) // 4
    (3.980102e-18 6.500000e-02 0.000000e+00) // 5
    (-6.500000e-02 7.960204e-18 0.000000e+00) // 6
    (-1.194031e-17 -6.500000e-02 0.000000e+00) // 7
    (1.000000e-01 0.000000e+00 5.000000e-01) // 8
    (6.123234e-18 1.000000e-01 5.000000e-01) // 9
    (-1.000000e-01 1.224647e-17 5.000000e-01) // 10
    (-1.836970e-17 -1.000000e-01 5.000000e-01) // 11
    (6.500000e-02 0.000000e+00 5.000000e-01) // 12
    (3.980102e-18 6.500000e-02 5.000000e-01) // 13
    (-6.500000e-02 7.960204e-18 5.000000e-01) // 14
    (-1.194031e-17 -6.500000e-02 5.000000e-01) // 15
);

blocks
(
hex (0 1 5 4 8 9 13 12) porosity (30 30 100)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (1 2 6 5 9 10 14 13) porosity (30 30 100)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (2 3 7 6 10 11 15 14) porosity (30 30 100)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (3 0 4 7 11 8 12 15) porosity (30 30 100)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (4 5 6 7 12 13 14 15) porosity (30 30 100)  edgeGrading (1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000)
);

edges
(
arc 0 1 (7.071068e-02 7.071068e-02 0.000000e+00) 
arc 1 2 (-7.071068e-02 7.071068e-02 0.000000e+00) 
arc 2 3 (-7.071068e-02 -7.071068e-02 0.000000e+00) 
arc 3 0 (7.071068e-02 -7.071068e-02 0.000000e+00) 
arc 4 5 (3.747666e-02 3.747666e-02 0.000000e+00) 
arc 5 6 (-3.747666e-02 3.747666e-02 0.000000e+00) 
arc 6 7 (-3.747666e-02 -3.747666e-02 0.000000e+00) 
arc 7 4 (3.747666e-02 -3.747666e-02 0.000000e+00) 
arc 8 9 (7.071068e-02 7.071068e-02 5.000000e-01) 
arc 9 10 (-7.071068e-02 7.071068e-02 5.000000e-01) 
arc 10 11 (-7.071068e-02 -7.071068e-02 5.000000e-01) 
arc 11 8 (7.071068e-02 -7.071068e-02 5.000000e-01) 
arc 12 13 (3.747666e-02 3.747666e-02 5.000000e-01) 
arc 13 14 (-3.747666e-02 3.747666e-02 5.000000e-01) 
arc 14 15 (-3.747666e-02 -3.747666e-02 5.000000e-01) 
arc 15 12 (3.747666e-02 -3.747666e-02 5.000000e-01) 
);

boundary
(
   bottom
   {
       type patch;
       faces
       (
       (1 0 4 5)
       (2 1 5 6)
       (3 2 6 7)
       (0 3 7 4)
       (5 4 7 6)
       );
   }
   walls
   {
      type wall;
      faces
      (
      (0 1 9 8)
      (1 2 10 9)
      (2 3 11 10)
      (3 0 8 11)
      );
   }
   top
   {
      type patch;
      faces
      (
      (8 9 13 12)
      (9 10 14 13)
      (10 11 15 14)
      (11 8 12 15)
      (12 13 14 15)
      );
   }
);

mergePatchPairs
(
);

